# Preprocessing

In [81]:
# import lybraris
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn import preprocessing
# I add this lybraris for get mean,max or other thing that I need in fill missing Value
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import normalize
from sklearn.preprocessing import minmax_scale

In [11]:
tot = pd.read_csv('./season5/c_data.csv',header=1,na_values=['?','??','???'])
sm = pd.read_csv('./season5/smartphones.csv',na_values=['?','??','???'],index_col='Name')

In [12]:
tot.head()

,1,CountryName,CountryCode,Population growth,Total population,Area (sq. km)
0,2,Brazil,BRA,0.817556,207652865.0,8358140.0
1,3,Switzerland,CHE,1.077221,8372098.0,39516.0
2,4,Germany,DEU,1.193867,82667685.0,348900.0
3,5,Denmark,DNK,0.834638,NaN,42262.0
4,6,Spain,ESP,-0.008048,46443959.0,500210.0

In [13]:
tod = tot.copy()

In [14]:
tod.rename(columns={
    'CountryName':'Name',
    'CountryCode':'Code',
    'Population growth':'Pop',
    'Total population':'T_Pop',
    'Area (sq. km)':'Area'
},inplace=True)

In [15]:
tod.head()

   1         Name Code       Pop        T_Pop       Area
0  2       Brazil  BRA  0.817556  207652865.0  8358140.0
1  3  Switzerland  CHE  1.077221    8372098.0    39516.0
2  4      Germany  DEU  1.193867   82667685.0   348900.0
3  5      Denmark  DNK  0.834638          NaN    42262.0
4  6        Spain  ESP -0.008048   46443959.0   500210.0

### Delete some Column,without effect

In [16]:
tod.drop('Code',axis=1,inplace=True)

In [17]:
tod.drop('1',axis=1,inplace=True)

In [18]:
tod.head()

          Name       Pop        T_Pop       Area
0       Brazil  0.817556  207652865.0  8358140.0
1  Switzerland  1.077221    8372098.0    39516.0
2      Germany  1.193867   82667685.0   348900.0
3      Denmark  0.834638          NaN    42262.0
4        Spain -0.008048   46443959.0   500210.0

In [19]:
tod.rename(index=tod.Name,inplace=True)

In [20]:
tod.head()

                    Name       Pop        T_Pop       Area
Brazil            Brazil  0.817556  207652865.0  8358140.0
Switzerland  Switzerland  1.077221    8372098.0    39516.0
Germany          Germany  1.193867   82667685.0   348900.0
Denmark          Denmark  0.834638          NaN    42262.0
Spain              Spain -0.008048   46443959.0   500210.0

In [21]:
tod.drop('Name',axis=1,inplace=True)

In [22]:
tod.head()

                  Pop        T_Pop       Area
Brazil       0.817556  207652865.0  8358140.0
Switzerland  1.077221    8372098.0    39516.0
Germany      1.193867   82667685.0   348900.0
Denmark      0.834638          NaN    42262.0
Spain       -0.008048   46443959.0   500210.0

In [23]:
tod.info()

<class 'pandas.core.frame.DataFrame'>
Index: 16 entries, Brazil to World
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pop     14 non-null     float64
 1   T_Pop   15 non-null     float64
 2   Area    15 non-null     float64
dtypes: float64(3)
memory usage: 512.0+ bytes

In [24]:
tod.describe()

             Pop         T_Pop          Area
count  14.000000  1.500000e+01  1.500000e+01
mean    1.145492  6.422767e+08  9.762744e+06
std     1.173195  1.909868e+09  3.325701e+07
min    -0.687543  2.569804e+06  1.161000e+04
25%     0.510007  1.032493e+07  2.389000e+05
50%     1.112718  6.689611e+07  4.463000e+05
75%     1.190820  1.564921e+08  1.269765e+06
max     3.495070  7.442136e+09  1.297332e+08

In [25]:
tod.max()

Pop      3.495070e+00
T_Pop    7.442136e+09
Area     1.297332e+08
dtype: float64

In [26]:
# we can see that we have World population also,and this make our data False for prediction
maxT_pop = tod['T_Pop'].max()

In [27]:
maxT_pop

7442135578.0

In [28]:
tod['T_Pop'][tod['T_Pop']==maxT_pop]

World    7.442136e+09
Name: T_Pop, dtype: float64

In [29]:
# we find the max,Value which is unworthy
# and now I want to Delete this data
tod.drop('World',axis=0,inplace=True)

In [30]:
tod.describe()

             Pop         T_Pop          Area
count  13.000000  1.400000e+01  1.400000e+01
mean    1.142708  1.565725e+08  1.193428e+06
std     1.221052  3.425607e+08  2.208912e+06
min    -0.687543  2.569804e+06  1.161000e+04
25%     0.407491  1.011403e+07  1.839000e+05
50%     1.077221  5.667003e+07  4.268050e+05
75%     1.193867  1.159128e+08  8.199668e+05
max     3.495070  1.324171e+09  8.358140e+06

In [31]:
# and now I want to know which country have max population in world
maxT_pop = tod['T_Pop'].max()
tod['T_Pop'][tod['T_Pop']==maxT_pop]

India    1.324171e+09
Name: T_Pop, dtype: float64

## Missing  Value

In [32]:
tod.isnull()

               Pop  T_Pop   Area
Brazil       False  False  False
Switzerland  False  False  False
Germany      False  False  False
Denmark      False   True  False
Spain        False  False  False
France       False  False  False
Japan        False  False  False
Greece       False  False  False
Iran         False  False  False
Kuwait       False  False   True
Morocco       True  False  False
Nigeria      False  False  False
Qatar        False  False  False
Sweden        True  False  False
India        False  False  False

In [33]:
# I want to know how many missing value I have in my DataSet
tod.isnull().sum()

Pop      2
T_Pop    1
Area     1
dtype: int64

In [34]:
# if I want to delete all row that have Nan Value I can use this method
too= tod.copy()
too.dropna(axis=0,inplace=True)
too.info()

<class 'pandas.core.frame.DataFrame'>
Index: 11 entries, Brazil to India
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pop     11 non-null     float64
 1   T_Pop   11 non-null     float64
 2   Area    11 non-null     float64
dtypes: float64(3)
memory usage: 352.0+ bytes

In [35]:
tod.info()

<class 'pandas.core.frame.DataFrame'>
Index: 15 entries, Brazil to India
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pop     13 non-null     float64
 1   T_Pop   14 non-null     float64
 2   Area    14 non-null     float64
dtypes: float64(3)
memory usage: 1.1+ KB

In [36]:
tod

                  Pop         T_Pop       Area
Brazil       0.817556  2.076529e+08  8358140.0
Switzerland  1.077221  8.372098e+06    39516.0
Germany      1.193867  8.266768e+07   348900.0
Denmark      0.834638           NaN    42262.0
Spain       -0.008048  4.644396e+07   500210.0
France       0.407491  6.689611e+07   547557.0
Japan       -0.115284  1.269945e+08   364560.0
Greece      -0.687543  1.074674e+07   128900.0
Iran         1.148789  8.027743e+07  1628760.0
Kuwait       2.924206  4.052584e+06        NaN
Morocco           NaN  3.527679e+07   446300.0
Nigeria      2.619034  1.859896e+08   910770.0
Qatar        3.495070  2.569804e+06    11610.0
Sweden            NaN  9.903122e+06   407310.0
India        1.148215  1.324171e+09  2973190.0

In [37]:
# If I want to replace all missing value whit a value,I can use this method
mod= tod.copy()
mod.fillna('0',inplace=True)
mod

                    Pop        T_Pop         Area
Brazil         0.817556  2.07653e+08  8.35814e+06
Switzerland     1.07722   8.3721e+06        39516
Germany         1.19387  8.26677e+07       348900
Denmark        0.834638            0        42262
Spain       -0.00804809   4.6444e+07       500210
France         0.407491  6.68961e+07       547557
Japan         -0.115284  1.26995e+08       364560
Greece        -0.687543  1.07467e+07       128900
Iran            1.14879  8.02774e+07  1.62876e+06
Kuwait          2.92421  4.05258e+06            0
Morocco               0  3.52768e+07       446300
Nigeria         2.61903   1.8599e+08       910770
Qatar           3.49507   2.5698e+06        11610
Sweden                0  9.90312e+06       407310
India           1.14821  1.32417e+09  2.97319e+06

In [38]:
# if we want to fill whit custome data we can use this methode
tod.fillna({
    'Pop':0,
    'T_Pop':10000000,
    'Area':500000
})

                  Pop         T_Pop       Area
Brazil       0.817556  2.076529e+08  8358140.0
Switzerland  1.077221  8.372098e+06    39516.0
Germany      1.193867  8.266768e+07   348900.0
Denmark      0.834638  1.000000e+07    42262.0
Spain       -0.008048  4.644396e+07   500210.0
France       0.407491  6.689611e+07   547557.0
Japan       -0.115284  1.269945e+08   364560.0
Greece      -0.687543  1.074674e+07   128900.0
Iran         1.148789  8.027743e+07  1628760.0
Kuwait       2.924206  4.052584e+06   500000.0
Morocco      0.000000  3.527679e+07   446300.0
Nigeria      2.619034  1.859896e+08   910770.0
Qatar        3.495070  2.569804e+06    11610.0
Sweden       0.000000  9.903122e+06   407310.0
India        1.148215  1.324171e+09  2973190.0

In [39]:
tod

                  Pop         T_Pop       Area
Brazil       0.817556  2.076529e+08  8358140.0
Switzerland  1.077221  8.372098e+06    39516.0
Germany      1.193867  8.266768e+07   348900.0
Denmark      0.834638           NaN    42262.0
Spain       -0.008048  4.644396e+07   500210.0
France       0.407491  6.689611e+07   547557.0
Japan       -0.115284  1.269945e+08   364560.0
Greece      -0.687543  1.074674e+07   128900.0
Iran         1.148789  8.027743e+07  1628760.0
Kuwait       2.924206  4.052584e+06        NaN
Morocco           NaN  3.527679e+07   446300.0
Nigeria      2.619034  1.859896e+08   910770.0
Qatar        3.495070  2.569804e+06    11610.0
Sweden            NaN  9.903122e+06   407310.0
India        1.148215  1.324171e+09  2973190.0

In [40]:
# Using ffill Method,This method copy the up record for nan value
tod.fillna(method='ffill')

                  Pop         T_Pop       Area
Brazil       0.817556  2.076529e+08  8358140.0
Switzerland  1.077221  8.372098e+06    39516.0
Germany      1.193867  8.266768e+07   348900.0
Denmark      0.834638  8.266768e+07    42262.0
Spain       -0.008048  4.644396e+07   500210.0
France       0.407491  6.689611e+07   547557.0
Japan       -0.115284  1.269945e+08   364560.0
Greece      -0.687543  1.074674e+07   128900.0
Iran         1.148789  8.027743e+07  1628760.0
Kuwait       2.924206  4.052584e+06  1628760.0
Morocco      2.924206  3.527679e+07   446300.0
Nigeria      2.619034  1.859896e+08   910770.0
Qatar        3.495070  2.569804e+06    11610.0
Sweden       3.495070  9.903122e+06   407310.0
India        1.148215  1.324171e+09  2973190.0

In [41]:
# Use the SimpleImputer for fill the missing value
i = SimpleImputer(missing_values=np.nan,strategy='mean',verbose=0)

In [42]:
i.fit(tod)

SimpleImputer()

In [43]:
b=i.transform(tod)

In [44]:
b

array([[ 8.17555711e-01,  2.07652865e+08,  8.35814000e+06],
       [ 1.07722117e+00,  8.37209800e+06,  3.95160000e+04],
       [ 1.19386676e+00,  8.26676850e+07,  3.48900000e+05],
       [ 8.34637611e-01,  1.56572478e+08,  4.22620000e+04],
       [-8.04808600e-03,  4.64439590e+07,  5.00210000e+05],
       [ 4.07491036e-01,  6.68961090e+07,  5.47557000e+05],
       [-1.15284177e-01,  1.26994511e+08,  3.64560000e+05],
       [-6.87542545e-01,  1.07467400e+07,  1.28900000e+05],
       [ 1.14878860e+00,  8.02774280e+07,  1.62876000e+06],
       [ 2.92420619e+00,  4.05258400e+06,  1.19342750e+06],
       [ 1.14270849e+00,  3.52767860e+07,  4.46300000e+05],
       [ 2.61903353e+00,  1.85989640e+08,  9.10770000e+05],
       [ 3.49506992e+00,  2.56980400e+06,  1.16100000e+04],
       [ 1.14270849e+00,  9.90312200e+06,  4.07310000e+05],
       [ 1.14821469e+00,  1.32417135e+09,  2.97319000e+06]])

## Duplicated Data

In [45]:
# import new data namayl dot
dot = pd.read_csv('./season5/mydata.csv',na_values=['?','??','???'])

In [46]:
dot

   columns1 columns2 columns3
0         1        a        A
1         2        a        A
2         2        a        A
3         3        b        B
4         4        b        B
5         4        b        B

In [47]:
dot.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [48]:
# Remove Duplicated Data
dot.drop_duplicates()

   columns1 columns2 columns3
0         1        a        A
1         2        a        A
3         3        b        B
4         4        b        B

In [49]:
dot

   columns1 columns2 columns3
0         1        a        A
1         2        a        A
2         2        a        A
3         3        b        B
4         4        b        B
5         4        b        B

In [50]:
# if I want to remove duplicated data whit same Column we add name of the column is our pranthsi
dot.drop_duplicates(['columns2'])

   columns1 columns2 columns3
0         1        a        A
3         3        b        B

## Concatenate tow DataSet

In [51]:
#read tow Data Set
d1 = pd.read_csv('./season5/my_source1.csv',na_values=['?','??','???'])
d2 = pd.read_csv('./season5/my_source2.csv',na_values=['?','??','???'])

In [52]:
d1

       0  1   2   3   4
0  babak  1  13  17  17
1   raha  2  14  14  15
2   sara  3  17  12  20
3   reza  4  12  18  19

In [53]:
d2

        0  1   2   3
0   babak  1  13  17
1   baran  2  15  20
2    sara  3  14  19
3   arash  4  20  19
4  mehran  5  15  18
5    reza  6  14  12

In [54]:
my_con = pd.concat([d1,d2],axis=0,ignore_index=True)

In [55]:
my_con

        0  1   2   3     4
0   babak  1  13  17  17.0
1    raha  2  14  14  15.0
2    sara  3  17  12  20.0
3    reza  4  12  18  19.0
4   babak  1  13  17   NaN
5   baran  2  15  20   NaN
6    sara  3  14  19   NaN
7   arash  4  20  19   NaN
8  mehran  5  15  18   NaN
9    reza  6  14  12   NaN

In [56]:
sm.head()

                   OS  Capacity  Ram  Weight    Company  inch
Name
Galaxy S10    Android       128    8   163.0    Samsung   6.2
Lumia 950    windows         32    3   150.0  Microsoft   5.2
Xpreia 1 ll   Android       256    8   181.0       Sony   6.5
iphone 7          ios       128    2   138.0      Apple   4.7
U Ultra       Android        64    4   170.0        HTC   5.7

In [57]:
sm.describe()

         Capacity       Ram      Weight      inch
count    9.000000  9.000000    9.000000  9.000000
mean   113.777778  4.222222  162.277778  5.544444
std     93.104481  2.279132   27.833333  0.698411
min     16.000000  2.000000  138.000000  4.700000
25%     32.000000  3.000000  144.500000  5.000000
50%    128.000000  4.000000  150.000000  5.200000
75%    128.000000  4.000000  170.000000  6.200000
max    256.000000  8.000000  226.000000  6.500000

In [58]:
sm.OS.value_counts()

Android     6
ios         2
windows     1
Name: OS, dtype: int64

In [59]:
sm.Company.value_counts()

Samsung      2
Apple        2
Google       1
Motorola     1
HTC          1
Sony         1
Microsoft    1
Name: Company, dtype: int64

In [60]:
sm.Capacity.value_counts()

128    3
16     2
256    2
64     1
32     1
Name: Capacity, dtype: int64

In [61]:
# If I wnat to generate a dataFreme for our Column name,I can use the groupby method
mean_os = sm.groupby(sm['OS'])

In [62]:
mean_os

In [63]:
mean_os.mean()

            Capacity       Ram  Weight      inch
OS
Android   101.333333  4.833333  157.75  5.583333
ios       192.000000  3.000000  182.00  5.600000
windows    32.000000  3.000000  150.00  5.200000

In [64]:
mean_com = sm.groupby(sm['Company'])

In [65]:
mean_com.max()

                 OS  Capacity  Ram  Weight  inch
Company
Apple           ios       256    4   226.0   6.5
Google      Android       128    4   143.0   5.0
HTC         Android        64    4   170.0   5.7
Microsoft  windows         32    3   150.0   5.2
Motorola    Android        16    3   144.5   5.0
Samsung     Android       128    8   163.0   6.2
Sony        Android       256    8   181.0   6.5

In [66]:
mean_com.max()

                 OS  Capacity  Ram  Weight  inch
Company
Apple           ios       256    4   226.0   6.5
Google      Android       128    4   143.0   5.0
HTC         Android        64    4   170.0   5.7
Microsoft  windows         32    3   150.0   5.2
Motorola    Android        16    3   144.5   5.0
Samsung     Android       128    8   163.0   6.2
Sony        Android       256    8   181.0   6.5

In [67]:
mean_com.std()

            Capacity       Ram     Weight      inch
Company
Apple      90.509668  1.414214  62.225397  1.272792
Google           NaN       NaN        NaN       NaN
HTC              NaN       NaN        NaN       NaN
Microsoft        NaN       NaN        NaN       NaN
Motorola         NaN       NaN        NaN       NaN
Samsung    79.195959  4.242641  12.727922  0.777817
Sony             NaN       NaN        NaN       NaN

In [68]:
sm

                         OS  Capacity  Ram  Weight    Company  inch
Name
Galaxy S10          Android       128    8   163.0    Samsung   6.2
Lumia 950          windows         32    3   150.0  Microsoft   5.2
Xpreia 1 ll         Android       256    8   181.0       Sony   6.5
iphone 7                ios       128    2   138.0      Apple   4.7
U Ultra             Android        64    4   170.0        HTC   5.7
Galaxy S5           Android        16    2   145.0    Samsung   5.1
iphone 11 pro max       ios       256    4   226.0      Apple   6.5
Moto G5             Android        16    3   144.5   Motorola   5.0
Pixel               Android       128    4   143.0     Google   5.0

In [69]:
yoo=pd.crosstab(sm.OS,sm.Ram)

In [70]:
pd.crosstab(sm.OS,sm.Capacity)

Capacity  16   32   64   128  256
OS
Android     2    0    1    2    1
ios         0    0    0    1    1
windows     0    1    0    0    0

In [71]:
sm

                         OS  Capacity  Ram  Weight    Company  inch
Name
Galaxy S10          Android       128    8   163.0    Samsung   6.2
Lumia 950          windows         32    3   150.0  Microsoft   5.2
Xpreia 1 ll         Android       256    8   181.0       Sony   6.5
iphone 7                ios       128    2   138.0      Apple   4.7
U Ultra             Android        64    4   170.0        HTC   5.7
Galaxy S5           Android        16    2   145.0    Samsung   5.1
iphone 11 pro max       ios       256    4   226.0      Apple   6.5
Moto G5             Android        16    3   144.5   Motorola   5.0
Pixel               Android       128    4   143.0     Google   5.0

In [72]:
ss= pd.get_dummies(sm)

In [73]:
ss

,Capacity,Ram,Weight,inch,OS_Android,OS_ios,OS_windows,Company_Apple,Company_Google,Company_HTC,Company_Microsoft,Company_Motorola,Company_Samsung,Company_Sony
Name,,,,,,,,,,,,,,
Galaxy S10,128,8,163.0,6.2,1,0,0,0,0,0,0,0,1,0
Lumia 950,32,3,150.0,5.2,0,0,1,0,0,0,1,0,0,0
Xpreia 1 ll,256,8,181.0,6.5,1,0,0,0,0,0,0,0,0,1
iphone 7,128,2,138.0,4.7,0,1,0,1,0,0,0,0,0,0
U Ultra,64,4,170.0,5.7,1,0,0,0,0,1,0,0,0,0
Galaxy S5,16,2,145.0,5.1,1,0,0,0,0,0,0,0,1,0
iphone 11 pro max,256,4,226.0,6.5,0,1,0,1,0,0,0,0,0,0
Moto G5,16,3,144.5,5.0,1,0,0,0,0,0,0,1,0,0
Pixel,128,4,143.0,5.0,1,0,0,0,1,0,0,0,0,0

In [74]:
sm

                         OS  Capacity  Ram  Weight    Company  inch
Name
Galaxy S10          Android       128    8   163.0    Samsung   6.2
Lumia 950          windows         32    3   150.0  Microsoft   5.2
Xpreia 1 ll         Android       256    8   181.0       Sony   6.5
iphone 7                ios       128    2   138.0      Apple   4.7
U Ultra             Android        64    4   170.0        HTC   5.7
Galaxy S5           Android        16    2   145.0    Samsung   5.1
iphone 11 pro max       ios       256    4   226.0      Apple   6.5
Moto G5             Android        16    3   144.5   Motorola   5.0
Pixel               Android       128    4   143.0     Google   5.0

In [75]:
sm.describe()

         Capacity       Ram      Weight      inch
count    9.000000  9.000000    9.000000  9.000000
mean   113.777778  4.222222  162.277778  5.544444
std     93.104481  2.279132   27.833333  0.698411
min     16.000000  2.000000  138.000000  4.700000
25%     32.000000  3.000000  144.500000  5.000000
50%    128.000000  4.000000  150.000000  5.200000
75%    128.000000  4.000000  170.000000  6.200000
max    256.000000  8.000000  226.000000  6.500000

# Normalization or Standardization
## using Scale Methode

- If we see to Capacity it's in range [16-->256],and if we see to Ram it's in range
- [2-->8] and it's have effect on our out put featuers,for this reson we use standarization and we will
- normal our Data,

In [76]:
# add Normalization
from sklearn.preprocessing import scale

In [77]:
# sm_scale = scale(sm)
sm.drop(['OS'],axis=1,inplace=True)

In [78]:
sm

                   Capacity  Ram  Weight    Company  inch
Name
Galaxy S10              128    8   163.0    Samsung   6.2
Lumia 950                32    3   150.0  Microsoft   5.2
Xpreia 1 ll             256    8   181.0       Sony   6.5
iphone 7                128    2   138.0      Apple   4.7
U Ultra                  64    4   170.0        HTC   5.7
Galaxy S5                16    2   145.0    Samsung   5.1
iphone 11 pro max       256    4   226.0      Apple   6.5
Moto G5                  16    3   144.5   Motorola   5.0
Pixel                   128    4   143.0     Google   5.0

In [79]:
sm_scale = scale(sm)

ValueError: could not convert string to float: 'Samsung'

In [ ]:
sm_scale

In [ ]:
sn = pd.DataFrame(sm_scale,index=sm.index,columns=sm.columns)

In [ ]:
sn

In [ ]:
np.std(sn.Capacity)

In [ ]:
sn.describe()

In [ ]:
# it's Center all data,How?
# it's mean=0,and std=1

# Normalization 
## Min_Max normalization

In [ ]:
na_index = ['one','tow','three','four']
na_value = [8,10,15,20]
tod = pd.DataFrame(data=na_value,index = na_index)

In [ ]:
tod

In [ ]:
tod_scale = scale(tod)

In [ ]:
tod_scale

In [ ]:
minmax = minmax_scale(tod,feature_range=(0,1))

In [ ]:
minmax